import styled from "styled-components";
import { media } from "../../../../global-style";
import { AliCenter, JC_SB } from "../../../../global-style/style-variables";
import { DefaultCheckBox } from "../../../../global-style/UI-kit";

const Title = styled.div`
  text-align: center;
  font-weight: 700;
  font-size: 28px;
  line-height: 35px;
  ${media.mobile} {
    font-size: 14px;
    line-height: 18px;
  }
`;

const BoxsWrapper = styled.div`
  display: grid;
  align-items: center;
  grid-template-columns: 1fr 1.1fr 1fr;
  gap: 20px;
  margin-top: 40px;
  ${media.mobile} {
    grid-template-columns: 1fr;
  }
`;

const Box = styled.div`
  border: 2px solid #fdce05;
  box-shadow: 0px 6px 18px 8px rgba(156, 156, 156, 0.25);
  border-radius: 20px;
  text-align: center;
  padding: 22px 20px 44px;
  h2 {
    font-weight: 800;
    font-size: 24px;
    line-height: 30px;
    margin: 12px 0px 20px;
  }
  p {
    font-weight: 500;
    padding-top: 20px;
    font-size: 16px;
    line-height: 20px;
    position: relative;
    :before {
      content: "";
      position: absolute;
      top: 0%;
      width: 70%;
      height: 1px;
      left: 0;
      right: 0;
      margin: auto;
      background: #e7e7e7;
    }
  }
  :nth-child(2) {
    padding-bottom: 58px;
  }
  ${media.mobile} {
    display: flex;
    h2 {
      font-weight: 800;
      font-size: 14px;
      line-height: 18px;
      margin: 8px 0px 0px;
    }
    p {
      font-weight: 400;
      font-size: 14px;
      padding-left: 8px;
      line-height: 18px;
      text-align: left;
      color: #868686;
      padding-top: unset;
      :before {
        left: 0;
        margin: unset;
        height: 100%;
        width: 1px;
      }
    }
    svg {
      width: 29.33px;
    }
    align-items: center;
    padding: 19px !important;
  }
`;

const BoxFooter = styled.div`
  padding-top: 40px;
  border-top: 1px solid #e7e7e7;
  h2 {
    font-weight: 600;
    font-size: 20px;
    line-height: 25px;
    margin-bottom: 20px;
  }
`;

const BoxFooterItem = styled(JC_SB)`
  b {
    font-weight: 800;
    font-size: 24px;
    line-height: 30px;
  }
  ${media.mobile} {
    b {
      line-height: 15.12px;
      font-weight: 500;
      font-size: 12px;
    }
  }
`;

const Wrapper = styled.div`
  padding: 40px;
`;

const Flex = styled.div`
  ${media.mobile} {
    margin-right: 8px;
  }
`;

const ZvWr = styled(AliCenter)`
  justify-content: center;
`;

export const PopUpReklama = () => {
  return (
    <Wrapper>
      <Title>Рекламировать объявление</Title>
      <BoxsWrapper>
        <Box>
          <Flex>
            <svg
              width="40"
              height="39"
              viewBox="0 0 40 39"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M18.9718 0.708465C19.4382 -0.0665192 20.5618 -0.0665185 21.0282 0.708465L26.9794 10.5973C27.1469 10.8757 27.4202 11.0743 27.7368 11.1476L38.9807 13.7517C39.8619 13.9558 40.209 15.0244 39.6161 15.7074L32.0503 24.4232C31.8373 24.6686 31.7329 24.9898 31.761 25.3136L32.7589 36.8119C32.8371 37.713 31.9281 38.3734 31.0953 38.0205L20.4681 33.5183C20.1689 33.3916 19.8311 33.3916 19.5319 33.5183L8.90474 38.0205C8.0719 38.3734 7.16292 37.713 7.24113 36.8119L8.23903 25.3136C8.26712 24.9898 8.16273 24.6686 7.94972 24.4232L0.383882 15.7074C-0.209048 15.0244 0.13815 13.9558 1.01933 13.7517L12.2632 11.1476C12.5798 11.0743 12.8531 10.8757 13.0206 10.5973L18.9718 0.708465Z"
                fill="#FDCE05"
              />
            </svg>

            <h2>
              СТАНДАРТ<br></br> 300 ₸
            </h2>
          </Flex>
          <p>
            Это текст - рыба, часто используемый в печати и вэб-дизайне является стандартной рыбой
            то текст - рыба, часто
          </p>
        </Box>
        <Box>
          <Flex>
            <ZvWr>
              <svg
                width="26"
                height="26"
                viewBox="0 0 26 26"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M11.9725 1.04184C12.4389 0.266856 13.5624 0.266856 14.0288 1.04184L17.5662 6.91973C17.7337 7.19814 18.007 7.3967 18.3236 7.47002L25.0069 9.01789C25.8881 9.22197 26.2353 10.2905 25.6424 10.9736L21.1453 16.1542C20.9322 16.3996 20.8279 16.7209 20.856 17.0446L21.4491 23.8791C21.5273 24.7802 20.6183 25.4406 19.7855 25.0878L13.4688 22.4117C13.1696 22.2849 12.8317 22.2849 12.5325 22.4117L6.21582 25.0878C5.38298 25.4406 4.474 24.7802 4.5522 23.8791L5.14535 17.0446C5.17345 16.7209 5.06906 16.3996 4.85604 16.1542L0.358948 10.9736C-0.233983 10.2905 0.113214 9.22197 0.994391 9.01789L7.6777 7.47002C7.99427 7.3967 8.26756 7.19814 8.43512 6.91973L11.9725 1.04184Z"
                  fill="#FDCE05"
                />
              </svg>
              <svg
                width="40"
                height="39"
                viewBox="0 0 40 39"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M18.9718 0.708465C19.4382 -0.0665192 20.5618 -0.0665185 21.0282 0.708465L26.9794 10.5973C27.1469 10.8757 27.4202 11.0743 27.7368 11.1476L38.9807 13.7517C39.8619 13.9558 40.209 15.0244 39.6161 15.7074L32.0503 24.4232C31.8373 24.6686 31.7329 24.9898 31.761 25.3136L32.7589 36.8119C32.8371 37.713 31.9281 38.3734 31.0953 38.0205L20.4681 33.5183C20.1689 33.3916 19.8311 33.3916 19.5319 33.5183L8.90474 38.0205C8.0719 38.3734 7.16292 37.713 7.24113 36.8119L8.23903 25.3136C8.26712 24.9898 8.16273 24.6686 7.94972 24.4232L0.383882 15.7074C-0.209048 15.0244 0.13815 13.9558 1.01933 13.7517L12.2632 11.1476C12.5798 11.0743 12.8531 10.8757 13.0206 10.5973L18.9718 0.708465Z"
                  fill="#FDCE05"
                />
              </svg>
              <svg
                width="26"
                height="26"
                viewBox="0 0 26 26"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M11.9725 1.04184C12.4389 0.266856 13.5624 0.266856 14.0288 1.04184L17.5662 6.91973C17.7337 7.19814 18.007 7.3967 18.3236 7.47002L25.0069 9.01789C25.8881 9.22197 26.2353 10.2905 25.6424 10.9736L21.1453 16.1542C20.9322 16.3996 20.8279 16.7209 20.856 17.0446L21.4491 23.8791C21.5273 24.7802 20.6183 25.4406 19.7855 25.0878L13.4688 22.4117C13.1696 22.2849 12.8317 22.2849 12.5325 22.4117L6.21582 25.0878C5.38298 25.4406 4.474 24.7802 4.5522 23.8791L5.14535 17.0446C5.17345 16.7209 5.06906 16.3996 4.85604 16.1542L0.358948 10.9736C-0.233983 10.2905 0.113214 9.22197 0.994391 9.01789L7.6777 7.47002C7.99427 7.3967 8.26756 7.19814 8.43512 6.91973L11.9725 1.04184Z"
                  fill="#FDCE05"
                />
              </svg>
            </ZvWr>

            <h2>
              ПРЕМИУМ
              <br></br> 900 ₸
            </h2>
          </Flex>
          <p>
            Это текст - рыба, часто используемый в печати и вэб-дизайне является стандартной рыбой
            то текст - рыба, часто
          </p>
        </Box>
        <Box>
          <Flex>
            <ZvWr>
              <svg
                width="34"
                height="33"
                viewBox="0 0 34 33"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.9712 1.37509C16.4376 0.600109 17.5611 0.600108 18.0275 1.37509L22.7718 9.25846C22.9394 9.53688 23.2127 9.73544 23.5292 9.80876L32.4928 11.8847C33.374 12.0888 33.7212 13.1574 33.1283 13.8404L27.0968 20.7886C26.8838 21.034 26.7794 21.3553 26.8075 21.679L27.603 30.8454C27.6812 31.7465 26.7722 32.4069 25.9394 32.0541L17.4675 28.4649C17.1683 28.3382 16.8304 28.3382 16.5312 28.4649L8.05931 32.0541C7.22646 32.4069 6.31749 31.7465 6.39569 30.8454L7.19121 21.679C7.21931 21.3553 7.11492 21.034 6.90191 20.7886L0.870439 13.8404C0.277509 13.1574 0.624705 12.0888 1.50588 11.8847L10.4695 9.80876C10.786 9.73544 11.0593 9.53688 11.2269 9.25846L15.9712 1.37509Z"
                  fill="#FDCE05"
                />
              </svg>

              <svg
                width="34"
                height="33"
                viewBox="0 0 34 33"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.9712 1.37509C16.4376 0.600109 17.5611 0.600108 18.0275 1.37509L22.7718 9.25846C22.9394 9.53688 23.2127 9.73544 23.5292 9.80876L32.4928 11.8847C33.374 12.0888 33.7212 13.1574 33.1283 13.8404L27.0968 20.7886C26.8838 21.034 26.7794 21.3553 26.8075 21.679L27.603 30.8454C27.6812 31.7465 26.7722 32.4069 25.9394 32.0541L17.4675 28.4649C17.1683 28.3382 16.8304 28.3382 16.5312 28.4649L8.05931 32.0541C7.22646 32.4069 6.31749 31.7465 6.39569 30.8454L7.19121 21.679C7.21931 21.3553 7.11492 21.034 6.90191 20.7886L0.870439 13.8404C0.277509 13.1574 0.624705 12.0888 1.50588 11.8847L10.4695 9.80876C10.786 9.73544 11.0593 9.53688 11.2269 9.25846L15.9712 1.37509Z"
                  fill="#FDCE05"
                />
              </svg>
            </ZvWr>
            <h2>
              БИЗНЕС
              <br></br>600 ₸
            </h2>
          </Flex>
          <p>
            Это текст - рыба, часто используемый в печати и вэб-дизайне является стандартной рыбой
            то текст - рыба, часто
          </p>
        </Box>
      </BoxsWrapper>
      <BoxFooter>
        <h2>Другие доступные услуги:</h2>
        <BoxFooterItem>
          <DefaultCheckBox labelText={"7 поднятий вверх списка (ежедневно, 7 дней)"} />
          <b>900 ₸</b>
        </BoxFooterItem>
        <BoxFooterItem>
          <DefaultCheckBox labelText={"Отправить в TOP - объявления)"} />
          <b>900 ₸</b>
        </BoxFooterItem>
        <BoxFooterItem>
          <DefaultCheckBox labelText={"Отправить в VIP - объявления"} />
          <b>900 ₸</b>
        </BoxFooterItem>
      </BoxFooter>
    </Wrapper>
  );
};
